app/views/snippets/_form.html.erb

SELECT "langs".* FROM "langs"   ORDER BY "langs"."order_type" ASC, "langs"."name" ASC
---
    <div class="col-sm-10">
      <%= f.collection_select :lang_id, Lang.order(:order_type, :name), :id, :name,
                              { :selected => @snippet.lang_id, :prompt => "-- Select language --" },
                              { :class => "form-control form-control-lang" } %>