app/views/snippets/_snippet.html.erb

SELECT  "langs".* FROM "langs"  WHERE "langs"."id" = ? LIMIT 1  [["id", 2]]
---
    <div id="snippet-<%= snippet.id %>" class="snippet-container collapse out">
      <%= raw Pygments.highlight(snippet.snippet, lexer: snippet.lang.value.downcase, :options => { :linenos => true }) %>