app/views/snippets/search.html.erb

SELECT "langs".* FROM "langs"   ORDER BY "langs"."order_type" ASC, "langs"."name" ASC
---
    <dt>Lang:</dt>
    <dd><%= collection_select :lang, :id, Lang.order(:order_type, :name), :id, :name,
                                {:prompt => '-- None selected --'},
                                {:name => 'lang_id', :class => 'form-control'} %></dd>