app/views/snippets/show.html.erb

SELECT  "langs".* FROM "langs"  WHERE "langs"."id" = ? LIMIT 1  [["id", 8]]
SELECT  "snippets".* FROM "snippets"  WHERE "snippets"."id" = ? LIMIT 1  [["id", 37]]
---
  <dt>Snippet:</dt>
  <dd><%= raw Pygments.highlight(@snippet.snippet, lexer: @snippet.lang.value.downcase) %></dd>