app/controllers/sessions_controller.rb

INSERT INTO "users" ("created_at", "name", "provider", "uid", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-05-21 08:57:10.017956"], ["name", "Dawid Zawadzki"], ["provider", "github"], ["uid", "1146276"], ["updated_at", "2014-05-21 08:57:10.017956"]]
SELECT  "users".* FROM "users"  WHERE "users"."provider" = 'github' AND "users"."uid" = '1146276' LIMIT 1
---
  def create
    auth = request.env["omniauth.auth"]
    user = User.find_by_provider_and_uid(auth["provider"], auth["uid"]) || User.create_with_omniauth(auth)