app/controllers/snippets_controller.rb

  def index
    # Simple page validation
    unless page_check(params[:page])
      return false
    end

    if params[:page].nil? || params[:page].blank?
      params[:page] = 1
    end

    @snippets = apply_scopes(Snippet).paginate(page: params[:page], per_page: 10).order('created_at DESC')

    # TODO: move it to other `method` and implement `button` that pass get params to `snippets#index`
    unless params['snippet'].nil?
      @snippets_count_texts = @snippets.count.to_s + ' ' + 'snippet'.pluralize(@snippets.count)
---
SELECT COUNT(*) FROM "snippets"  WHERE (description LIKE '%bla%')

  def create
    @snippet = Snippet.new(snippet_params)

    unless lang_check(@snippet)
      return false
    end

    respond_to do |format|
      if @snippet.save
---
INSERT INTO "snippets" ("created_at", "description", "lang_id", "snippet", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-05-22 21:36:01.242525"], ["description", "asd"], ["lang_id", 8], ["snippet", "ads"], ["updated_at", "2014-05-22 21:36:01.242525"]]

    def set_snippet
      @snippet = Snippet.find(params[:id])
---
SELECT  "snippets".* FROM "snippets"  WHERE "snippets"."id" = ? LIMIT 1  [["id", 37]]